app/controllers/admin/exams_controller.rb

  def index
   @exams = Exam.all
---
SELECT `exams`.* FROM `exams`

  def show
    @exam = Exam.find_by_id(params[:id])
    @subject_lists = Subject.all
---
SELECT  `exams`.* FROM `exams` WHERE `exams`.`id` = 1 LIMIT 1
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`exam_id` = 1

  def create
    @exam = Exam.new(exam_params)
    respond_to do |format|
      if @exam.save
---
INSERT INTO `exams` (`title`, `description`, `created_at`, `updated_at`) VALUES ('SSC', 'SSC Exam in bangladesh', '2015-11-08 16:51:39', '2015-11-08 16:51:39')