app/controllers/admin/questions_controller.rb

SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 6 LIMIT 1
---
  def show
    @question = Question.find_by_id(params[:id])

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
INSERT INTO `questions` (`title`, `subject_id`, `created_at`, `updated_at`) VALUES ('test', 1, '2015-11-09 17:20:45', '2015-11-09 17:20:45')
---
  def create
    subject = Subject.find_by_id(params[:subject_id])
    question = subject.questions.build(question_params)
    if question.save

SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 28 LIMIT 1
UPDATE `questions` SET `correct_answer` = '47,48,49', `updated_at` = '2015-11-10 11:38:33' WHERE `questions`.`id` = 28
---
  def update_correct_answer
   @question = Question.find_by_id(params[:question_id])
   @question.correct_answer = ''
   @question.correct_answer = params[:correct_answer]
   @question.save