app/controllers/admin/subjects_controller.rb

  def show
    @subject =  Subject.find_by_id(params[:id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1

  def create
    exam = Exam.find_by_id(params[:exam_id])
    subject = exam.subjects.build(subject_params)
    subject.save
---
SELECT  `exams`.* FROM `exams` WHERE `exams`.`id` = 1 LIMIT 1
INSERT INTO `subjects` (`title`, `description`, `exam_id`, `created_at`, `updated_at`) VALUES ('English', 'English First Paper', 1, '2015-11-08 17:31:03', '2015-11-08 17:31:03')