app/views/admin/questions/show.html.erb

SELECT `answers`.* FROM `answers` WHERE `answers`.`question_id` = 6
---

<% if @question.answers.present? %>